number_dict = {
    '301': '臥室紅外線', '302': '浴室紅外線', '303': '廚房紅外線', '304': '客廳紅外線',
    '401': '洗手槽水龍頭流速', '402': '馬桶水箱流速', '403': '洗手槽水龍頭流速', '404': '洗手槽水龍頭流速',
    '501': '浴室門', '502': '冰箱門', '503': '廚櫃門', '504': '玄關門',
    '601': '燈', '602': '燈', '603': '燈', '604': '電磁爐', '605': '燈',
    '801': '地墊', '802': '地墊',
    '901': '電視',
    '1001': '窗簾',
    '1401': '紅外線發射器', '1402': '紅外線發射器', '1501': '情境模式',
    '2001': '智慧藥盒',
    'a01': '血壓計',
}
status_prefix_dict = {
    'power': '電源',
    'channel': '頻道',
    'mute': '靜音',
    'volume': '音量',
}
status_dict = {
    # 8
    'In': '進入', 'Out': '出去',
    # 3, 6
    'Open': '開', 'Close': '關',
    'On': '開', 'Off': '關',
    'on': '開', 'off': '關', 'stop': '停止',
    # 2001
    'Taken': '吃藥',
    # 1501
    'sleep': '睡眠', 'wake_up': '起床', 'go_home': '回家', 'go_out': '出門',
    'up': '升高', 'down': '降低',
    '24': '冷氣開,溫度25,風量中',
    '25': '冷氣開,溫度18,風量小',
    '26': '冷氣開,溫度19,風量小',
    '27': '冷氣開,溫度20,風量小',
    '28': '冷氣開,溫度21,風量小',
    '29': '冷氣開,溫度22,風量小',
    '30': '冷氣開,溫度23,風量小',
    '31': '冷氣開,溫度24,風量小',
    '32': '冷氣開,溫度25,風量小',
    '33': '冷氣開,溫度26,風量小',
    '34': '冷氣開,溫度27,風量小',
    '35': '冷氣開,溫度28,風量小',
    '36': '冷氣開,溫度18,風量中',
    '37': '冷氣開,溫度19,風量中',
    '38': '冷氣開,溫度20,風量中',
    '39': '冷氣開,溫度21,風量中',
    '40': '冷氣開,溫度22,風量中',
    '41': '冷氣開,溫度23,風量中',
    '42': '冷氣開,溫度24,風量中',
    '43': '冷氣開,溫度25,風量中',
    '44': '冷氣開,溫度26,風量中',
    '45': '冷氣開,溫度27,風量中',
    '46': '冷氣開,溫度28,風量中',
    '47': '冷氣開,溫度18,風量強',
    '48': '冷氣開,溫度19,風量強',
    '49': '冷氣開,溫度20,風量強',
    '50': '冷氣開,溫度21,風量強',
    '51': '冷氣開,溫度22,風量強',
    '52': '冷氣開,溫度23,風量強',
    '53': '冷氣開,溫度24,風量強',
    '54': '冷氣開,溫度25,風量強',
    '55': '冷氣開,溫度26,風量強',
    '56': '冷氣開,溫度27,風量強',
    '57': '冷氣開,溫度28,風量強',
    '58': '冷氣睡眠,溫度26,自動',
    '59': '冷氣關',
}
status_dict_ir = {
    'On': '有人', 'Off': '無人',
}

# remote_control_dict = {
#     '01': '電視開關鍵', '02': '電視頻道向上', '03': '電視頻道向下', '04': '電視音量調大', '05': '電視音量調小', '06': '電視頻道1',
#     '07': '電視頻道2', '08': '電視頻道3', '09': '電視頻道4', '10': '電視頻道5', '11': '電視頻道6', '12': '電視頻道7',
#     '13': '電視頻道8', '14': '電視頻道9', '15': '電視頻道0', '16': '電視返回鍵', '17': '電視靜音鍵', '18': '電視輸入切換鍵',
#     '19': '上鍵', '20': '下鍵', '21': '左鍵', '22': '右鍵', '23': 'OK',
# }
